app/controllers/recipes_controller.rb

SELECT "user_favorite_recipes".* FROM "user_favorite_recipes" WHERE "user_favorite_recipes"."user_id" = $1 AND "user_favorite_recipes"."recipe_id" = $2 ORDER BY "user_favorite_recipes"."id" ASC LIMIT $3  [["user_id", 2], ["recipe_id", 9], ["LIMIT", 1]]
---
  def show
    @favorited_recipe = UserFavoriteRecipe.where(user: @current_user, recipe: @recipe).first

INSERT INTO "recipes" ("created_at", "updated_at", "author_id", "name", "description", "notes", "difficulty", "favorite", "cuisine", "diet", "time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params.merge(author: @current_user))
    if @recipe.save